#pragma once

/**
 * @brief Общее задание
 * 
 * В соответствии с вариантом (табл. 1.3), не используя прерываний и таймеров,
 * запрограммировать кнопки и светодиоды. Комментарии в тексте программы
 * обязательны, они должны пояснять что именно делает данные фрагмент. Не
 * допускается использовать иные заголовочные файлы, кроме msp430, не
 * допускается также использовать высокоуровневые библиотеки.
 */

/**
 * @brief Задание по варианту
 * 
 * |------------|--------------|---------|-------------------------------------|
 * | № варианта | Светодиоды и | Режим   | Переключение                        |
 * |            | кнопки       |         |                                     |
 * |------------|--------------|---------|-------------------------------------|
 * | 2          | LED2, S1, S2 | Мигание | Включение и выключение режима при   |
 * |            |              |         | нажатии любой из кнопок             |
 * |------------|--------------|---------|-------------------------------------|
 */
