#pragma once

/**
 * @brief Напряжение питания (Vcc, GND) (V)
 * |---------|-------------------|
 * | V       | 3.6               |
 * |---------|-------------------|
 */

/**
 * @brief Ток потребления микроконтроллера MSP430F5529 (jp6) (20mA)
 * |---------|---------|---------|
 * | FVM\LPM | ACTIVE  | LPM4    |
 * |---------|---------|---------|
 * | FH VH   | ~5.5    | ~4.9    |
 * | FH VL   | ~5.4    | ~4.8    |
 * | FL VL   | 5.1~5.5 | 4.5~5.1 |
 * | FL VH   | 5.0~5.6 | 4.6~5.1 |
 * |---------|---------|---------|
 */

/**
 * @brief Ток потребления экспериментальной платы MSP-EXP430F5529 (jp7) (20mA)
 * |---------|---------|---------|
 * | FVM\LPM | ACTIVE  | LPM4    |
 * |---------|---------|---------|
 * | FH VH   | 0.9     | 0.80    |
 * | FH VL   | 0.9     | 0.82    |
 * | FL VL   | 0.8     | 0.69    |
 * | FL VH   | 0.75    | 0.6~0.8 |
 * |---------|---------|---------|
 */
